const Login = () => {
    return(
        <div className="login-page">
            <div className="login-page-pic">
                <img className="pic-of-login" src="/pic/h26wpZ_EsKaBXjge_68_minsAAJjTexeXik9pd9z5rBIG0jsm7tTEzJcafJbGOM1.jpeg"></img>
                
                <div className="welcome-text">
                    <p className="text1">
                        خوش آمدید به ویلا جو
                    </p>
                    <p className="text2">
                        به دنیای اقامتگاه های خاص و تجربه های متفاوت بپیوندید.
                    </p>
                </div>

                <div className="dastresi">
                    <div className="dastresi1">
                        <svg className="dastresi1-1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"> <path fill="rgb(255, 255, 255)" d="M304 70.1C313.1 61.9 326.9 61.9 336 70.1L568 278.1C577.9 286.9 578.7 302.1 569.8 312C560.9 321.9 545.8 322.7 535.9 313.8L527.9 306.6L527.9 511.9C527.9 547.2 499.2 575.9 463.9 575.9L175.9 575.9C140.6 575.9 111.9 547.2 111.9 511.9L111.9 306.6L103.9 313.8C94 322.6 78.9 321.8 70 312C61.1 302.2 62 287 71.8 278.1L304 70.1zM320 120.2L160 263.7L160 512C160 520.8 167.2 528 176 528L224 528L224 424C224 384.2 256.2 352 296 352L344 352C383.8 352 416 384.2 416 424L416 528L464 528C472.8 528 480 520.8 480 512L480 263.7L320 120.3zM272 528L368 528L368 424C368 410.7 357.3 400 344 400L296 400C282.7 400 272 410.7 272 424L272 528z"/></svg>                        
                        <p className="dastresi1-2">
                            اقامتگاه های متنوع
                        </p>
                    </div>

                    <div className="dastresi2">
                        <svg className="dastresi2-1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"> <path fill="rgb(255, 255, 255)" d="M320.1 32C329.1 32 337.4 37.1 341.5 45.1L415 189.3L574.9 214.7C583.8 216.1 591.2 222.4 594 231C596.8 239.6 594.5 249 588.2 255.4L473.7 369.9L499 529.8C500.4 538.7 496.7 547.7 489.4 553C482.1 558.3 472.4 559.1 464.4 555L320.1 481.6L175.8 555C167.8 559.1 158.1 558.3 150.8 553C143.5 547.7 139.8 538.8 141.2 529.8L166.4 369.9L52 255.4C45.6 249 43.4 239.6 46.2 231C49 222.4 56.3 216.1 65.3 214.7L225.2 189.3L298.8 45.1C302.9 37.1 311.2 32 320.2 32zM320.1 108.8L262.3 222C258.8 228.8 252.3 233.6 244.7 234.8L119.2 254.8L209 344.7C214.4 350.1 216.9 357.8 215.7 365.4L195.9 490.9L309.2 433.3C316 429.8 324.1 429.8 331 433.3L444.3 490.9L424.5 365.4C423.3 357.8 425.8 350.1 431.2 344.7L521 254.8L395.5 234.8C387.9 233.6 381.4 228.8 377.9 222L320.1 108.8z"/></svg>                        
                        <p className="dastresi2-2">
                            تضمین بهترین قیمت
                        </p>
                    </div>

                    <div className="dastresi3">
                        <svg className="dastresi3-1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"> <path fill="rgb(255, 255, 255)" d="M480 96C515.3 96 544 124.7 544 160L544 480C544 515.3 515.3 544 480 544L160 544C124.7 544 96 515.3 96 480L96 160C96 124.7 124.7 96 160 96L480 96zM160 144C151.2 144 144 151.2 144 160L144 480C144 488.8 151.2 496 160 496L480 496C488.8 496 496 488.8 496 480L496 160C496 151.2 488.8 144 480 144L160 144zM390.7 233.9C398.5 223.2 413.5 220.8 424.2 228.6C434.9 236.4 437.3 251.4 429.5 262.1L307.4 430.1C303.3 435.8 296.9 439.4 289.9 439.9C282.9 440.4 276 437.9 271.1 433L215.2 377.1C205.8 367.7 205.8 352.5 215.2 343.2C224.6 333.9 239.8 333.8 249.1 343.2L285.1 379.2L390.7 234z"/></svg>
                        <p className="dastresi3-2">
                            پشتیبانی 24 ساعته
                        </p>
                    </div>

                </div>
            </div>

            <div className="login-page-form">
                <div className="form">
                    <img className="logo-form" src="/pic/vilajo_logo_crop__1___1_-removebg-preview (1).png"></img>
                    <p className="matn1">
                        ورود به حساب کاربری
                    </p>
                    <p className="matn2">
                        برای ادامه، شماره موبایل یا ایمیل خود را وارد کنید.
                    </p>

                    <div className="input-box1">
                            <input className="input" type="text" placeholder="ایمیل یا شماره موبایل" />
                            <svg className="input-icon1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"> <path fill="rgb(4, 4, 4)" d="M125.4 128C91.5 128 64 155.5 64 189.4C64 190.3 64 191.1 64.1 192L64 192L64 448C64 483.3 92.7 512 128 512L512 512C547.3 512 576 483.3 576 448L576 192L575.9 192C575.9 191.1 576 190.3 576 189.4C576 155.5 548.5 128 514.6 128L125.4 128zM528 256.3L528 448C528 456.8 520.8 464 512 464L128 464C119.2 464 112 456.8 112 448L112 256.3L266.8 373.7C298.2 397.6 341.7 397.6 373.2 373.7L528 256.3zM112 189.4C112 182 118 176 125.4 176L514.6 176C522 176 528 182 528 189.4C528 193.6 526 197.6 522.7 200.1L344.2 335.5C329.9 346.3 310.1 346.3 295.8 335.5L117.3 200.1C114 197.6 112 193.6 112 189.4z"/></svg>                    
                    </div>

                    <div className="input-box2">
                            <input className="input" type="password" placeholder="رمز عبور" />
                            <svg className="input-icon1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path fill="rgb(4, 4, 4)" d="M320 144C254.8 144 201.2 173.6 160.1 211.7C121.6 247.5 95 290 81.4 320C95 350 121.6 392.5 160.1 428.3C201.2 466.4 254.8 496 320 496C385.2 496 438.8 466.4 479.9 428.3C518.4 392.5 545 350 558.6 320C545 290 518.4 247.5 479.9 211.7C438.8 173.6 385.2 144 320 144zM127.4 176.6C174.5 132.8 239.2 96 320 96C400.8 96 465.5 132.8 512.6 176.6C559.4 220.1 590.7 272 605.6 307.7C608.9 315.6 608.9 324.4 605.6 332.3C590.7 368 559.4 420 512.6 463.4C465.5 507.1 400.8 544 320 544C239.2 544 174.5 507.2 127.4 463.4C80.6 419.9 49.3 368 34.4 332.3C31.1 324.4 31.1 315.6 34.4 307.7C49.3 272 80.6 220 127.4 176.6zM320 400C364.2 400 400 364.2 400 320C400 290.4 383.9 264.5 360 250.7C358.6 310.4 310.4 358.6 250.7 360C264.5 383.9 290.4 400 320 400zM240.4 311.6C242.9 311.9 245.4 312 248 312C283.3 312 312 283.3 312 248C312 245.4 311.8 242.9 311.6 240.4C274.2 244.3 244.4 274.1 240.5 311.5zM286 196.6C296.8 193.6 308.2 192.1 319.9 192.1C328.7 192.1 337.4 193 345.7 194.7C346 194.8 346.2 194.8 346.5 194.9C404.4 207.1 447.9 258.6 447.9 320.1C447.9 390.8 390.6 448.1 319.9 448.1C258.3 448.1 206.9 404.6 194.7 346.7C192.9 338.1 191.9 329.2 191.9 320.1C191.9 309.1 193.3 298.3 195.9 288.1C196.1 287.4 196.2 286.8 196.4 286.2C208.3 242.8 242.5 208.6 285.9 196.7z"/></svg>
                    </div>

                    <div className="item">

                        <div className="item1">
                            <p className="item1-1">
                                <input className="square" type="checkbox"></input>
                                مرا به خاطر بسپار
                            </p>
                        </div>

                        <div className="item2">
                            <p className="item2-1">
                                رمز خود را فراموش کرده ام؟
                            </p>
                        </div>

                    </div>
                    
                    <button className="btn-login">
                        ورود
                    </button>

                    <div className="divider">
                        <span>یا ورود با</span>
                    </div>

                    <div className="login-item">
                        <div className="login-item1">
                            Apple
                            <svg className="login-item1-1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path fill="rgb(4, 4, 4)" d="M447.1 332.7C446.9 296 463.5 268.3 497.1 247.9C478.3 221 449.9 206.2 412.4 203.3C376.9 200.5 338.1 224 323.9 224C308.9 224 274.5 204.3 247.5 204.3C191.7 205.2 132.4 248.8 132.4 337.5C132.4 363.7 137.2 390.8 146.8 418.7C159.6 455.4 205.8 545.4 254 543.9C279.2 543.3 297 526 329.8 526C361.6 526 378.1 543.9 406.2 543.9C454.8 543.2 496.6 461.4 508.8 424.6C443.6 393.9 447.1 334.6 447.1 332.7zM390.5 168.5C417.8 136.1 415.3 106.6 414.5 96C390.4 97.4 362.5 112.4 346.6 130.9C329.1 150.7 318.8 175.2 321 202.8C347.1 204.8 370.9 191.4 390.5 168.5z"/></svg>
                        </div>
                        <div className="login-item2">
                            Google
                            <img className="login-item2-1" src="/pic/channels4_profile-removebg-preview.png"></img>
                        </div>
                    </div>
                    <div className="prompt-link">
                        <p className="signup-prompt">حساب کاربری ندارید؟</p>
                        <p className="signup-link">ثبت نام کنید</p>
                    </div>
                    
                </div>
            </div>
        </div>
    )
}

export default Login;